/*
Напишите программу для работы с массивом вещественных чисел.

Реализуйте класс ArrayOperations, который содержит следующие статические методы:

FindMax(double[] array): Метод принимает на вход массив вещественных чисел array 
и возвращает максимальное число из массива.

FindMin(double[] array): Метод принимает на вход массив вещественных чисел array
 и возвращает минимальное число из массива.

CalcDifferenceBetweenMaxMin(double[] array): Метод принимает на вход массив вещественных чисел array 
и возвращает разницу между максимальным и минимальным числами в массиве.

PrintArray(double[] array): Метод для вывода массива на экран. Он принимает на вход массив array
 и выводит его элементы с двумя знаками после запятой через табуляцию.

Аргументы, передаваемые в метод/функцию:

'3.17, 8.94, 2.36, 5.72, 0.85'
На выходе:


Массив:
3.17    8.94    2.36    5.72    0.85    
Разность между максимальным и минимальным элементом = 8.09
*/