/*
Напишите программу, которая находит сумму элементов с нечетными индексами в одномерном массиве
 целых чисел и выводит результат на экран.
 
Программа должна иметь метод SumOddElements, который принимает массив целых чисел 
и возвращает сумму элементов с нечетными индексами в массиве.

Программа должна иметь метод PrintArray, который выводит элементы массива на экран.

При выводе элементы массива должны быть разделены символом табуляции "\t".

Аргументы, передаваемые в метод/функцию:


'18, 76, 11'
На выходе:


18      76      11  
Сумма нечетных элементов: 76
*/